Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware_secure/src/packs/PIC32CK2051SG01144_DFP/component/rtc.h
/* -------- RTC_MODE1_PER : (RTC Offset: 0x1C) (R/W 16) MODE1 Counter Period -------- */
#define RTC_MODE1_PER_RESETVALUE              _UINT16_(0x00)                                       /*  (RTC_MODE1_PER) MODE1 Counter Period  Reset Value */

#define RTC_MODE1_PER_PER_Pos                 _UINT16_(0)                                          /* (RTC_MODE1_PER) Counter Period Position */
#define RTC_MODE1_PER_PER_Msk                 (_UINT16_(0xFFFF) << RTC_MODE1_PER_PER_Pos)          /* (RTC_MODE1_PER) Counter Period Mask */
#define RTC_MODE1_PER_PER(value)              (RTC_MODE1_PER_PER_Msk & (_UINT16_(value) << RTC_MODE1_PER_PER_Pos)) /* Assigment of value for PER in the RTC_MODE1_PER register */
#define RTC_MODE1_PER_Msk                     _UINT16_(0xFFFF)                                     /* (RTC_MODE1_PER) Register Mask  */


/* -------- RTC_MODE0_COMP : (RTC Offset: 0x20) (R/W 32) MODE0 Compare n Value -------- */
#define RTC_MODE0_COMP_RESETVALUE             _UINT32_(0x00)                                       /*  (RTC_MODE0_COMP) MODE0 Compare n Value  Reset Value */

#define RTC_MODE0_COMP_COMP_Pos               _UINT32_(0)                                          /* (RTC_MODE0_COMP) Compare Value Position */
#define RTC_MODE0_COMP_COMP_Msk               (_UINT32_(0xFFFFFFFF) << RTC_MODE0_COMP_COMP_Pos)    /* (RTC_MODE0_COMP) Compare Value Mask */
#define RTC_MODE0_COMP_COMP(value)            (RTC_MODE0_COMP_COMP_Msk & (_UINT32_(value) << RTC_MODE0_COMP_COMP_Pos)) /* Assigment of value for COMP in the RTC_MODE0_COMP register */
#define RTC_MODE0_COMP_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (RTC_MODE0_COMP) Register Mask  */


/* -------- RTC_MODE1_COMP : (RTC Offset: 0x20) (R/W 16) MODE1 Compare n Value -------- */
#define RTC_MODE1_COMP_RESETVALUE             _UINT16_(0x00)                                       /*  (RTC_MODE1_COMP) MODE1 Compare n Value  Reset Value */

#define RTC_MODE1_COMP_COMP_Pos               _UINT16_(0)                                          /* (RTC_MODE1_COMP) Compare Value Position */
#define RTC_MODE1_COMP_COMP_Msk               (_UINT16_(0xFFFF) << RTC_MODE1_COMP_COMP_Pos)        /* (RTC_MODE1_COMP) Compare Value Mask */
#define RTC_MODE1_COMP_COMP(value)            (RTC_MODE1_COMP_COMP_Msk & (_UINT16_(value) << RTC_MODE1_COMP_COMP_Pos)) /* Assigment of value for COMP in the RTC_MODE1_COMP register */
#define RTC_MODE1_COMP_Msk                    _UINT16_(0xFFFF)                                     /* (RTC_MODE1_COMP) Register Mask  */


/* -------- RTC_GP : (RTC Offset: 0x40) (R/W 32) General Purpose -------- */
#define RTC_GP_RESETVALUE                     _UINT32_(0x00)                                       /*  (RTC_GP) General Purpose  Reset Value */

#define RTC_GP_GP_Pos                         _UINT32_(0)                                          /* (RTC_GP) General Purpose Position */
#define RTC_GP_GP_Msk                         (_UINT32_(0xFFFFFFFF) << RTC_GP_GP_Pos)              /* (RTC_GP) General Purpose Mask */
#define RTC_GP_GP(value)                      (RTC_GP_GP_Msk & (_UINT32_(value) << RTC_GP_GP_Pos)) /* Assigment of value for GP in the RTC_GP register */
#define RTC_GP_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (RTC_GP) Register Mask  */


/* -------- RTC_TAMPCTRL : (RTC Offset: 0x60) (R/W 32) Tamper Control -------- */
#define RTC_TAMPCTRL_RESETVALUE               _UINT32_(0x00)                                       /*  (RTC_TAMPCTRL) Tamper Control  Reset Value */

#define RTC_TAMPCTRL_IN0ACT_Pos               _UINT32_(0)                                          /* (RTC_TAMPCTRL) Tamper Input 0 Action Position */
#define RTC_TAMPCTRL_IN0ACT_Msk               (_UINT32_(0x3) << RTC_TAMPCTRL_IN0ACT_Pos)           /* (RTC_TAMPCTRL) Tamper Input 0 Action Mask */
#define RTC_TAMPCTRL_IN0ACT(value)            (RTC_TAMPCTRL_IN0ACT_Msk & (_UINT32_(value) << RTC_TAMPCTRL_IN0ACT_Pos)) /* Assigment of value for IN0ACT in the RTC_TAMPCTRL register */
#define   RTC_TAMPCTRL_IN0ACT_OFF_Val         _UINT32_(0x0)                                        /* (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN0ACT_WAKE_Val        _UINT32_(0x1)                                        /* (RTC_TAMPCTRL) Wake and set Tamper flag  */
#define   RTC_TAMPCTRL_IN0ACT_CAPTURE_Val     _UINT32_(0x2)                                        /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag  */
#define   RTC_TAMPCTRL_IN0ACT_ACTL_Val        _UINT32_(0x3)                                        /* (RTC_TAMPCTRL) Compare IN0 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag  */
#define RTC_TAMPCTRL_IN0ACT_OFF               (RTC_TAMPCTRL_IN0ACT_OFF_Val << RTC_TAMPCTRL_IN0ACT_Pos) /* (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN0ACT_WAKE              (RTC_TAMPCTRL_IN0ACT_WAKE_Val << RTC_TAMPCTRL_IN0ACT_Pos) /* (RTC_TAMPCTRL) Wake and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN0ACT_CAPTURE           (RTC_TAMPCTRL_IN0ACT_CAPTURE_Val << RTC_TAMPCTRL_IN0ACT_Pos) /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN0ACT_ACTL              (RTC_TAMPCTRL_IN0ACT_ACTL_Val << RTC_TAMPCTRL_IN0ACT_Pos) /* (RTC_TAMPCTRL) Compare IN0 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN1ACT_Pos               _UINT32_(2)                                          /* (RTC_TAMPCTRL) Tamper Input 1 Action Position */
#define RTC_TAMPCTRL_IN1ACT_Msk               (_UINT32_(0x3) << RTC_TAMPCTRL_IN1ACT_Pos)           /* (RTC_TAMPCTRL) Tamper Input 1 Action Mask */
#define RTC_TAMPCTRL_IN1ACT(value)            (RTC_TAMPCTRL_IN1ACT_Msk & (_UINT32_(value) << RTC_TAMPCTRL_IN1ACT_Pos)) /* Assigment of value for IN1ACT in the RTC_TAMPCTRL register */
#define   RTC_TAMPCTRL_IN1ACT_OFF_Val         _UINT32_(0x0)                                        /* (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN1ACT_WAKE_Val        _UINT32_(0x1)                                        /* (RTC_TAMPCTRL) Wake and set Tamper flag  */
#define   RTC_TAMPCTRL_IN1ACT_CAPTURE_Val     _UINT32_(0x2)                                        /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag  */
#define   RTC_TAMPCTRL_IN1ACT_ACTL_Val        _UINT32_(0x3)                                        /* (RTC_TAMPCTRL) Compare IN1 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag  */
#define RTC_TAMPCTRL_IN1ACT_OFF               (RTC_TAMPCTRL_IN1ACT_OFF_Val << RTC_TAMPCTRL_IN1ACT_Pos) /* (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN1ACT_WAKE              (RTC_TAMPCTRL_IN1ACT_WAKE_Val << RTC_TAMPCTRL_IN1ACT_Pos) /* (RTC_TAMPCTRL) Wake and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN1ACT_CAPTURE           (RTC_TAMPCTRL_IN1ACT_CAPTURE_Val << RTC_TAMPCTRL_IN1ACT_Pos) /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN1ACT_ACTL              (RTC_TAMPCTRL_IN1ACT_ACTL_Val << RTC_TAMPCTRL_IN1ACT_Pos) /* (RTC_TAMPCTRL) Compare IN1 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN2ACT_Pos               _UINT32_(4)                                          /* (RTC_TAMPCTRL) Tamper Input 2 Action Position */
#define RTC_TAMPCTRL_IN2ACT_Msk               (_UINT32_(0x3) << RTC_TAMPCTRL_IN2ACT_Pos)           /* (RTC_TAMPCTRL) Tamper Input 2 Action Mask */
#define RTC_TAMPCTRL_IN2ACT(value)            (RTC_TAMPCTRL_IN2ACT_Msk & (_UINT32_(value) << RTC_TAMPCTRL_IN2ACT_Pos)) /* Assigment of value for IN2ACT in the RTC_TAMPCTRL register */
#define   RTC_TAMPCTRL_IN2ACT_OFF_Val         _UINT32_(0x0)                                        /* (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN2ACT_WAKE_Val        _UINT32_(0x1)                                        /* (RTC_TAMPCTRL) Wake and set Tamper flag  */
#define   RTC_TAMPCTRL_IN2ACT_CAPTURE_Val     _UINT32_(0x2)                                        /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag  */
#define   RTC_TAMPCTRL_IN2ACT_ACTL_Val        _UINT32_(0x3)                                        /* (RTC_TAMPCTRL) Compare IN2 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag  */
#define RTC_TAMPCTRL_IN2ACT_OFF               (RTC_TAMPCTRL_IN2ACT_OFF_Val << RTC_TAMPCTRL_IN2ACT_Pos) /* (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN2ACT_WAKE              (RTC_TAMPCTRL_IN2ACT_WAKE_Val << RTC_TAMPCTRL_IN2ACT_Pos) /* (RTC_TAMPCTRL) Wake and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN2ACT_CAPTURE           (RTC_TAMPCTRL_IN2ACT_CAPTURE_Val << RTC_TAMPCTRL_IN2ACT_Pos) /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN2ACT_ACTL              (RTC_TAMPCTRL_IN2ACT_ACTL_Val << RTC_TAMPCTRL_IN2ACT_Pos) /* (RTC_TAMPCTRL) Compare IN2 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN3ACT_Pos               _UINT32_(6)                                          /* (RTC_TAMPCTRL) Tamper Input 3 Action Position */
#define RTC_TAMPCTRL_IN3ACT_Msk               (_UINT32_(0x3) << RTC_TAMPCTRL_IN3ACT_Pos)           /* (RTC_TAMPCTRL) Tamper Input 3 Action Mask */
#define RTC_TAMPCTRL_IN3ACT(value)            (RTC_TAMPCTRL_IN3ACT_Msk & (_UINT32_(value) << RTC_TAMPCTRL_IN3ACT_Pos)) /* Assigment of value for IN3ACT in the RTC_TAMPCTRL register */
#define   RTC_TAMPCTRL_IN3ACT_OFF_Val         _UINT32_(0x0)                                        /* (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN3ACT_WAKE_Val        _UINT32_(0x1)                                        /* (RTC_TAMPCTRL) Wake and set Tamper flag  */
#define   RTC_TAMPCTRL_IN3ACT_CAPTURE_Val     _UINT32_(0x2)                                        /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag  */
#define   RTC_TAMPCTRL_IN3ACT_ACTL_Val        _UINT32_(0x3)                                        /* (RTC_TAMPCTRL) Compare IN3 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag  */
#define RTC_TAMPCTRL_IN3ACT_OFF               (RTC_TAMPCTRL_IN3ACT_OFF_Val << RTC_TAMPCTRL_IN3ACT_Pos) /* (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN3ACT_WAKE              (RTC_TAMPCTRL_IN3ACT_WAKE_Val << RTC_TAMPCTRL_IN3ACT_Pos) /* (RTC_TAMPCTRL) Wake and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN3ACT_CAPTURE           (RTC_TAMPCTRL_IN3ACT_CAPTURE_Val << RTC_TAMPCTRL_IN3ACT_Pos) /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN3ACT_ACTL              (RTC_TAMPCTRL_IN3ACT_ACTL_Val << RTC_TAMPCTRL_IN3ACT_Pos) /* (RTC_TAMPCTRL) Compare IN3 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN4ACT_Pos               _UINT32_(8)                                          /* (RTC_TAMPCTRL) Tamper Input 4 Action Position */
#define RTC_TAMPCTRL_IN4ACT_Msk               (_UINT32_(0x3) << RTC_TAMPCTRL_IN4ACT_Pos)           /* (RTC_TAMPCTRL) Tamper Input 4 Action Mask */
#define RTC_TAMPCTRL_IN4ACT(value)            (RTC_TAMPCTRL_IN4ACT_Msk & (_UINT32_(value) << RTC_TAMPCTRL_IN4ACT_Pos)) /* Assigment of value for IN4ACT in the RTC_TAMPCTRL register */
#define   RTC_TAMPCTRL_IN4ACT_OFF_Val         _UINT32_(0x0)                                        /* (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN4ACT_WAKE_Val        _UINT32_(0x1)                                        /* (RTC_TAMPCTRL) Wake and set Tamper flag  */
#define   RTC_TAMPCTRL_IN4ACT_CAPTURE_Val     _UINT32_(0x2)                                        /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag  */
#define   RTC_TAMPCTRL_IN4ACT_ACTL_Val        _UINT32_(0x3)                                        /* (RTC_TAMPCTRL) Compare IN4 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag  */
#define RTC_TAMPCTRL_IN4ACT_OFF               (RTC_TAMPCTRL_IN4ACT_OFF_Val << RTC_TAMPCTRL_IN4ACT_Pos) /* (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN4ACT_WAKE              (RTC_TAMPCTRL_IN4ACT_WAKE_Val << RTC_TAMPCTRL_IN4ACT_Pos) /* (RTC_TAMPCTRL) Wake and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN4ACT_CAPTURE           (RTC_TAMPCTRL_IN4ACT_CAPTURE_Val << RTC_TAMPCTRL_IN4ACT_Pos) /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN4ACT_ACTL              (RTC_TAMPCTRL_IN4ACT_ACTL_Val << RTC_TAMPCTRL_IN4ACT_Pos) /* (RTC_TAMPCTRL) Compare IN4 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN5ACT_Pos               _UINT32_(10)                                         /* (RTC_TAMPCTRL) Tamper Input 5 Action Position */
#define RTC_TAMPCTRL_IN5ACT_Msk               (_UINT32_(0x3) << RTC_TAMPCTRL_IN5ACT_Pos)           /* (RTC_TAMPCTRL) Tamper Input 5 Action Mask */
#define RTC_TAMPCTRL_IN5ACT(value)            (RTC_TAMPCTRL_IN5ACT_Msk & (_UINT32_(value) << RTC_TAMPCTRL_IN5ACT_Pos)) /* Assigment of value for IN5ACT in the RTC_TAMPCTRL register */
#define   RTC_TAMPCTRL_IN5ACT_OFF_Val         _UINT32_(0x0)                                        /* (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN5ACT_WAKE_Val        _UINT32_(0x1)                                        /* (RTC_TAMPCTRL) Wake and set Tamper flag  */
#define   RTC_TAMPCTRL_IN5ACT_CAPTURE_Val     _UINT32_(0x2)                                        /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag  */
#define   RTC_TAMPCTRL_IN5ACT_ACTL_Val        _UINT32_(0x3)                                        /* (RTC_TAMPCTRL) Compare IN5 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag  */
#define RTC_TAMPCTRL_IN5ACT_OFF               (RTC_TAMPCTRL_IN5ACT_OFF_Val << RTC_TAMPCTRL_IN5ACT_Pos) /* (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN5ACT_WAKE              (RTC_TAMPCTRL_IN5ACT_WAKE_Val << RTC_TAMPCTRL_IN5ACT_Pos) /* (RTC_TAMPCTRL) Wake and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN5ACT_CAPTURE           (RTC_TAMPCTRL_IN5ACT_CAPTURE_Val << RTC_TAMPCTRL_IN5ACT_Pos) /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN5ACT_ACTL              (RTC_TAMPCTRL_IN5ACT_ACTL_Val << RTC_TAMPCTRL_IN5ACT_Pos) /* (RTC_TAMPCTRL) Compare IN5 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN6ACT_Pos               _UINT32_(12)                                         /* (RTC_TAMPCTRL) Tamper Input 6 Action Position */
#define RTC_TAMPCTRL_IN6ACT_Msk               (_UINT32_(0x3) << RTC_TAMPCTRL_IN6ACT_Pos)           /* (RTC_TAMPCTRL) Tamper Input 6 Action Mask */
#define RTC_TAMPCTRL_IN6ACT(value)            (RTC_TAMPCTRL_IN6ACT_Msk & (_UINT32_(value) << RTC_TAMPCTRL_IN6ACT_Pos)) /* Assigment of value for IN6ACT in the RTC_TAMPCTRL register */
#define   RTC_TAMPCTRL_IN6ACT_OFF_Val         _UINT32_(0x0)                                        /* (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN6ACT_WAKE_Val        _UINT32_(0x1)                                        /* (RTC_TAMPCTRL) Wake and set Tamper flag  */
#define   RTC_TAMPCTRL_IN6ACT_CAPTURE_Val     _UINT32_(0x2)                                        /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag  */
#define   RTC_TAMPCTRL_IN6ACT_ACTL_Val        _UINT32_(0x3)                                        /* (RTC_TAMPCTRL) Compare IN6 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag  */
#define RTC_TAMPCTRL_IN6ACT_OFF               (RTC_TAMPCTRL_IN6ACT_OFF_Val << RTC_TAMPCTRL_IN6ACT_Pos) /* (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN6ACT_WAKE              (RTC_TAMPCTRL_IN6ACT_WAKE_Val << RTC_TAMPCTRL_IN6ACT_Pos) /* (RTC_TAMPCTRL) Wake and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN6ACT_CAPTURE           (RTC_TAMPCTRL_IN6ACT_CAPTURE_Val << RTC_TAMPCTRL_IN6ACT_Pos) /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN6ACT_ACTL              (RTC_TAMPCTRL_IN6ACT_ACTL_Val << RTC_TAMPCTRL_IN6ACT_Pos) /* (RTC_TAMPCTRL) Compare IN6 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN7ACT_Pos               _UINT32_(14)                                         /* (RTC_TAMPCTRL) Tamper Input 7 Action Position */
#define RTC_TAMPCTRL_IN7ACT_Msk               (_UINT32_(0x3) << RTC_TAMPCTRL_IN7ACT_Pos)           /* (RTC_TAMPCTRL) Tamper Input 7 Action Mask */
#define RTC_TAMPCTRL_IN7ACT(value)            (RTC_TAMPCTRL_IN7ACT_Msk & (_UINT32_(value) << RTC_TAMPCTRL_IN7ACT_Pos)) /* Assigment of value for IN7ACT in the RTC_TAMPCTRL register */
#define   RTC_TAMPCTRL_IN7ACT_OFF_Val         _UINT32_(0x0)                                        /* (RTC_TAMPCTRL) Off (Disabled)  */
#define   RTC_TAMPCTRL_IN7ACT_WAKE_Val        _UINT32_(0x1)                                        /* (RTC_TAMPCTRL) Wake and set Tamper flag  */
#define   RTC_TAMPCTRL_IN7ACT_CAPTURE_Val     _UINT32_(0x2)                                        /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag  */
#define   RTC_TAMPCTRL_IN7ACT_ACTL_Val        _UINT32_(0x3)                                        /* (RTC_TAMPCTRL) Compare IN7 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag  */
#define RTC_TAMPCTRL_IN7ACT_OFF               (RTC_TAMPCTRL_IN7ACT_OFF_Val << RTC_TAMPCTRL_IN7ACT_Pos) /* (RTC_TAMPCTRL) Off (Disabled) Position  */
#define RTC_TAMPCTRL_IN7ACT_WAKE              (RTC_TAMPCTRL_IN7ACT_WAKE_Val << RTC_TAMPCTRL_IN7ACT_Pos) /* (RTC_TAMPCTRL) Wake and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN7ACT_CAPTURE           (RTC_TAMPCTRL_IN7ACT_CAPTURE_Val << RTC_TAMPCTRL_IN7ACT_Pos) /* (RTC_TAMPCTRL) Capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_IN7ACT_ACTL              (RTC_TAMPCTRL_IN7ACT_ACTL_Val << RTC_TAMPCTRL_IN7ACT_Pos) /* (RTC_TAMPCTRL) Compare IN7 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag Position  */
#define RTC_TAMPCTRL_TAMLVL0_Pos              _UINT32_(16)                                         /* (RTC_TAMPCTRL) Tamper Level Select 0 Position */
#define RTC_TAMPCTRL_TAMLVL0_Msk              (_UINT32_(0x1) << RTC_TAMPCTRL_TAMLVL0_Pos)          /* (RTC_TAMPCTRL) Tamper Level Select 0 Mask */
#define RTC_TAMPCTRL_TAMLVL0(value)           (RTC_TAMPCTRL_TAMLVL0_Msk & (_UINT32_(value) << RTC_TAMPCTRL_TAMLVL0_Pos)) /* Assigment of value for TAMLVL0 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_TAMLVL1_Pos              _UINT32_(17)                                         /* (RTC_TAMPCTRL) Tamper Level Select 1 Position */
#define RTC_TAMPCTRL_TAMLVL1_Msk              (_UINT32_(0x1) << RTC_TAMPCTRL_TAMLVL1_Pos)          /* (RTC_TAMPCTRL) Tamper Level Select 1 Mask */
#define RTC_TAMPCTRL_TAMLVL1(value)           (RTC_TAMPCTRL_TAMLVL1_Msk & (_UINT32_(value) << RTC_TAMPCTRL_TAMLVL1_Pos)) /* Assigment of value for TAMLVL1 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_TAMLVL2_Pos              _UINT32_(18)                                         /* (RTC_TAMPCTRL) Tamper Level Select 2 Position */
#define RTC_TAMPCTRL_TAMLVL2_Msk              (_UINT32_(0x1) << RTC_TAMPCTRL_TAMLVL2_Pos)          /* (RTC_TAMPCTRL) Tamper Level Select 2 Mask */
#define RTC_TAMPCTRL_TAMLVL2(value)           (RTC_TAMPCTRL_TAMLVL2_Msk & (_UINT32_(value) << RTC_TAMPCTRL_TAMLVL2_Pos)) /* Assigment of value for TAMLVL2 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_TAMLVL3_Pos              _UINT32_(19)                                         /* (RTC_TAMPCTRL) Tamper Level Select 3 Position */
#define RTC_TAMPCTRL_TAMLVL3_Msk              (_UINT32_(0x1) << RTC_TAMPCTRL_TAMLVL3_Pos)          /* (RTC_TAMPCTRL) Tamper Level Select 3 Mask */
#define RTC_TAMPCTRL_TAMLVL3(value)           (RTC_TAMPCTRL_TAMLVL3_Msk & (_UINT32_(value) << RTC_TAMPCTRL_TAMLVL3_Pos)) /* Assigment of value for TAMLVL3 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_TAMLVL4_Pos              _UINT32_(20)                                         /* (RTC_TAMPCTRL) Tamper Level Select 4 Position */
#define RTC_TAMPCTRL_TAMLVL4_Msk              (_UINT32_(0x1) << RTC_TAMPCTRL_TAMLVL4_Pos)          /* (RTC_TAMPCTRL) Tamper Level Select 4 Mask */
#define RTC_TAMPCTRL_TAMLVL4(value)           (RTC_TAMPCTRL_TAMLVL4_Msk & (_UINT32_(value) << RTC_TAMPCTRL_TAMLVL4_Pos)) /* Assigment of value for TAMLVL4 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_TAMLVL5_Pos              _UINT32_(21)                                         /* (RTC_TAMPCTRL) Tamper Level Select 5 Position */
#define RTC_TAMPCTRL_TAMLVL5_Msk              (_UINT32_(0x1) << RTC_TAMPCTRL_TAMLVL5_Pos)          /* (RTC_TAMPCTRL) Tamper Level Select 5 Mask */
#define RTC_TAMPCTRL_TAMLVL5(value)           (RTC_TAMPCTRL_TAMLVL5_Msk & (_UINT32_(value) << RTC_TAMPCTRL_TAMLVL5_Pos)) /* Assigment of value for TAMLVL5 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_TAMLVL6_Pos              _UINT32_(22)                                         /* (RTC_TAMPCTRL) Tamper Level Select 6 Position */
#define RTC_TAMPCTRL_TAMLVL6_Msk              (_UINT32_(0x1) << RTC_TAMPCTRL_TAMLVL6_Pos)          /* (RTC_TAMPCTRL) Tamper Level Select 6 Mask */
#define RTC_TAMPCTRL_TAMLVL6(value)           (RTC_TAMPCTRL_TAMLVL6_Msk & (_UINT32_(value) << RTC_TAMPCTRL_TAMLVL6_Pos)) /* Assigment of value for TAMLVL6 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_TAMLVL7_Pos              _UINT32_(23)                                         /* (RTC_TAMPCTRL) Tamper Level Select 7 Position */
#define RTC_TAMPCTRL_TAMLVL7_Msk              (_UINT32_(0x1) << RTC_TAMPCTRL_TAMLVL7_Pos)          /* (RTC_TAMPCTRL) Tamper Level Select 7 Mask */
#define RTC_TAMPCTRL_TAMLVL7(value)           (RTC_TAMPCTRL_TAMLVL7_Msk & (_UINT32_(value) << RTC_TAMPCTRL_TAMLVL7_Pos)) /* Assigment of value for TAMLVL7 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_DEBNC0_Pos               _UINT32_(24)                                         /* (RTC_TAMPCTRL) Debouncer Enable 0 Position */
#define RTC_TAMPCTRL_DEBNC0_Msk               (_UINT32_(0x1) << RTC_TAMPCTRL_DEBNC0_Pos)           /* (RTC_TAMPCTRL) Debouncer Enable 0 Mask */
#define RTC_TAMPCTRL_DEBNC0(value)            (RTC_TAMPCTRL_DEBNC0_Msk & (_UINT32_(value) << RTC_TAMPCTRL_DEBNC0_Pos)) /* Assigment of value for DEBNC0 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_DEBNC1_Pos               _UINT32_(25)                                         /* (RTC_TAMPCTRL) Debouncer Enable 1 Position */
#define RTC_TAMPCTRL_DEBNC1_Msk               (_UINT32_(0x1) << RTC_TAMPCTRL_DEBNC1_Pos)           /* (RTC_TAMPCTRL) Debouncer Enable 1 Mask */
#define RTC_TAMPCTRL_DEBNC1(value)            (RTC_TAMPCTRL_DEBNC1_Msk & (_UINT32_(value) << RTC_TAMPCTRL_DEBNC1_Pos)) /* Assigment of value for DEBNC1 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_DEBNC2_Pos               _UINT32_(26)                                         /* (RTC_TAMPCTRL) Debouncer Enable 2 Position */
#define RTC_TAMPCTRL_DEBNC2_Msk               (_UINT32_(0x1) << RTC_TAMPCTRL_DEBNC2_Pos)           /* (RTC_TAMPCTRL) Debouncer Enable 2 Mask */
#define RTC_TAMPCTRL_DEBNC2(value)            (RTC_TAMPCTRL_DEBNC2_Msk & (_UINT32_(value) << RTC_TAMPCTRL_DEBNC2_Pos)) /* Assigment of value for DEBNC2 in the RTC_TAMPCTRL register */
#define RTC_TAMPCTRL_DEBNC3_Pos               _UINT32_(27)                                         /* (RTC_TAMPCTRL) Debouncer Enable 3 Position */
#define RTC_TAMPCTRL_DEBNC3_Msk               (_UINT32_(0x1) << RTC_TAMPCTRL_DEBNC3_Pos)           /* (RTC_TAMPCTRL) Debouncer Enable 3 Mask */
#define RTC_TAMPCTRL_DEBNC3(value)            (RTC_TAMPCTRL_DEBNC3_Msk & (_UINT32_(value) << RTC_TAMPCTRL_DEBNC3_Pos)) /* Assigment of value for DEBNC3 in the RTC_TAMPCTRL register */
